/*
Глава 6 Джосаттиса
Расшифровка отладочних сообщений
Концепты, тестовые классы, трейсеры.
*/
/*
Резюме и советы:
1. Отладочные сообщения достаточно громоздкие, необходима тщательная дешифровка.
2. Для проверки подобных ситуаций используется модель "мелкого инстанцирования" - 
   на верхнем уровне выполняется проверка шаблонного параметра на соответствие 
   некоторым требованиям (концепты!) Например, разыменование указателя.
3. Можно использовать интеллектуальные отладочние трейсеры для проверки 
   валидности параметров шаблонных функций и их алгоритмов.
*/